<a href="https://colab.research.google.com/github/SurajKande/python-pandas/blob/master/pandas_dataframe_manipulation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [43]:
# to connect gdrive to colab for importing dataset
from google.colab import drive
drive.mount('/content/gdrive', force_remount = True)

Mounted at /content/gdrive

In [0]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

###Subsetting data frame

In [0]:
election_data_frame = pd.read_csv('/content/gdrive/My Drive/datasets/pennsylvania2012_turnout.csv', header=0, index_col='county')

In [0]:
election_data_frame.head()

          state   total      Obama  ...  voters    turnout     margin
county                              ...
Adams        PA   41973  35.482334  ...   61156  68.632677  27.629667
Allegheny    PA  614671  56.640219  ...  924351  66.497575  14.454399
Armstrong    PA   28322  30.696985  ...   42147  67.198140  37.204293
Beaver       PA   80015  46.032619  ...  115157  69.483401   6.605012
Bedford      PA   21444  22.057452  ...   32189  66.619031  54.929118

[5 rows x 8 columns]

In [0]:
#subsetting the dataframe
election_result = election_data_frame[['winner', 'state', 'voters']]

In [0]:
p = election_data_frame.index

In [0]:
print(p)

Index(['Adams', 'Allegheny', 'Armstrong', 'Beaver', 'Bedford', 'Berks',
       'Blair', 'Bradford', 'Bucks', 'Butler', 'Cambria', 'Cameron', 'Carbon',
       'Centre', 'Chester', 'Clarion', 'Clearfield', 'Clinton', 'Columbia',
       'Crawford', 'Cumberland', 'Dauphin', 'Delaware', 'Elk', 'Erie',
       'Fayette', 'Forest', 'Franklin', 'Fulton', 'Greene', 'Huntingdon',
       'Indiana', 'Jefferson', 'Juniata', 'Lackawanna', 'Lancaster',
       'Lawrence', 'Lebanon', 'Lehigh', 'Luzerne', 'Lycoming', 'McKean',
       'Mercer', 'Mifflin', 'Monroe', 'Montgomery', 'Montour', 'Northampton',
       'Northumberland', 'Perry', 'Philadelphia', 'Pike', 'Potter',
       'Schuylkill', 'Snyder', 'Somerset', 'Sullivan', 'Susquehanna', 'Tioga',
       'Union', 'Venango', 'Warren', 'Washington', 'Wayne', 'Westmoreland',
       'Wyoming', 'York'],
      dtype='object', name='county')

In [0]:
election_result.head()

           winner state  voters
county
Adams      Romney    PA   61156
Allegheny   Obama    PA  924351
Armstrong  Romney    PA   42147
Beaver     Romney    PA  115157
Bedford    Romney    PA   32189

In [0]:
#subsetting the dataframe Alternative
rows = ['Philadelphia', 'Centre', 'Fulton']
col = ['winner', 'Obama', 'Romney']
PCL_counties = election_data_frame.loc[rows,col]
PCL_counties.head()

              winner      Obama     Romney
county
Philadelphia   Obama  85.224251  14.051451
Centre        Romney  48.948416  48.977486
Fulton        Romney  21.096291  77.748861

###Slicing rows and column of dataframe

In [0]:
# slicing rows using lables
counties_p = election_data_frame.loc['Perry':'Potter']

In [0]:
print(counties_p)

             state   total      Obama  ...   voters    turnout     margin
county                                 ...
Perry           PA   18240  29.769737  ...    27245  66.948064  38.821272
Philadelphia    PA  653598  85.224251  ...  1099197  59.461407  71.172800
Pike            PA   23164  43.904334  ...    41840  55.363289  10.978242
Potter          PA    7205  26.259542  ...    10913  66.022175  45.898681

[4 rows x 8 columns]

In [0]:
# slice rows in reverse order
counties_p_rev = election_data_frame.loc['Potter':'Perry':-1]
print(counties_p_rev)

             state   total      Obama  ...   voters    turnout     margin
county                                 ...
Potter          PA    7205  26.259542  ...    10913  66.022175  45.898681
Pike            PA   23164  43.904334  ...    41840  55.363289  10.978242
Philadelphia    PA  653598  85.224251  ...  1099197  59.461407  71.172800
Perry           PA   18240  29.769737  ...    27245  66.948064  38.821272

[4 rows x 8 columns]

In [0]:
# slicing columns 

# Slice the columns from the starting column to 'Obama': left_columns
left_columns = election_data_frame.loc[:,:'Obama']

# Print the output of left_columns.head()
print(left_columns.head())

          state   total      Obama
county
Adams        PA   41973  35.482334
Allegheny    PA  614671  56.640219
Armstrong    PA   28322  30.696985
Beaver       PA   80015  46.032619
Bedford      PA   21444  22.057452

In [0]:
# Slice the columns from 'Obama' to 'winner': middle_columns
middle_columns = election_data_frame.loc[:,'Obama' : 'winner']

# Print the output of middle_columns.head()
print(middle_columns.head())

               Obama     Romney  winner
county
Adams      35.482334  63.112001  Romney
Allegheny  56.640219  42.185820   Obama
Armstrong  30.696985  67.901278  Romney
Beaver     46.032619  52.637630  Romney
Bedford    22.057452  76.986570  Romney

In [0]:
# Slice the columns from 'Romney' to the end: 'right_columns'
right_columns = election_data_frame.loc[:,'Romney':]

# Print the output of right_columns.head()
print(right_columns.head())

              Romney  winner  voters    turnout     margin
county
Adams      63.112001  Romney   61156  68.632677  27.629667
Allegheny  42.185820   Obama  924351  66.497575  14.454399
Armstrong  67.901278  Romney   42147  67.198140  37.204293
Beaver     52.637630  Romney  115157  69.483401   6.605012
Bedford    76.986570  Romney   32189  66.619031  54.929118

###filtering

In [0]:
highturn_out = election_data_frame['turnout'] > 70
highturn_out_data_frame = election_data_frame[highturn_out]
highturn_out_data_frame.head()

         state   total      Obama  ...  voters    turnout     margin
county                             ...
Bucks       PA  319407  49.966970  ...  435606  73.324748   1.165284
Butler      PA   88924  31.920516  ...  122762  72.436096  34.896091
Chester     PA  248295  49.228539  ...  337822  73.498766   0.422079
Forest      PA    2308  38.734835  ...    3232  71.410891  21.100520
Franklin    PA   62802  30.110506  ...   87406  71.850903  38.473297

[5 rows x 8 columns]

In [0]:
#
too_close = election_data_frame['margin'] < 1

# Assign np.nan to the 'winner' column where the results were too close to call
election_data_frame.loc[too_close, 'winner'] = np.nan

# Print the output of election.info()
print(election_data_frame.info())            # we can observer 3 of the entries have cahnged to NaN for 'winner' column

<class 'pandas.core.frame.DataFrame'>
Index: 67 entries, Adams to York
Data columns (total 8 columns):
state      67 non-null object
total      67 non-null int64
Obama      67 non-null float64
Romney     67 non-null float64
winner     64 non-null object
voters     67 non-null int64
turnout    67 non-null float64
margin     67 non-null float64
dtypes: float64(4), int64(2), object(2)
memory usage: 7.2+ KB
None

### using .map()

In [0]:
red_blue = {'Obama':'red','Romney':'blue'}
election_data_frame['result_color'] = election_data_frame['winner'].map(red_blue)

In [0]:
election_data_frame.head()

          state   total      Obama  ...    turnout     margin  result_color
county                              ...
Adams        PA   41973  35.482334  ...  68.632677  27.629667          blue
Allegheny    PA  614671  56.640219  ...  66.497575  14.454399           red
Armstrong    PA   28322  30.696985  ...  67.198140  37.204293          blue
Beaver       PA   80015  46.032619  ...  69.483401   6.605012          blue
Bedford      PA   21444  22.057452  ...  66.619031  54.929118          blue

[5 rows x 9 columns]

### Using vectorized functions:
using vectorized functions, we can loop over the data at the same speed as compiled code (C, Fortran, etc.)! NumPy, SciPy and pandas come with a variety of vectorized functions called Universal Functions

zscore : z-score is the number of standard deviations by which an observation is above the mean - so if it is negative, it means the observation is below the mean.

In [0]:
# Import zscore from scipy.stats
from scipy.stats import zscore

# Call zscore with election['turnout'] as input: turnout_zscore
turnout_zscore = zscore(election_data_frame['turnout'])

# Print the type of turnout_zscore
print(type(turnout_zscore))

# Assign turnout_zscore to a new column: election['turnout_zscore']
election_data_frame['turnout_zscore'] = turnout_zscore

# Print the output of election.head()
print(election_data_frame.head())

<class 'numpy.ndarray'>
          state   total      Obama  ...     margin result_color  turnout_zscore
county                              ...
Adams        PA   41973  35.482334  ...  27.629667         blue        0.853734
Allegheny    PA  614671  56.640219  ...  14.454399          red        0.439846
Armstrong    PA   28322  30.696985  ...  37.204293         blue        0.575650
Beaver       PA   80015  46.032619  ...   6.605012         blue        1.018647
Bedford      PA   21444  22.057452  ...  54.929118         blue        0.463391

[5 rows x 10 columns]

### Indexing

In [0]:
# using new data set 
sales_data_frame = pd.read_csv('/content/gdrive/My Drive/datasets/sales/sales.csv', index_col='month')

In [0]:
sales_data_frame.head()

       eggs  salt  spam
month
Jan      47  12.0    17
Feb     110  50.0    31
Mar     221  89.0    72
Apr      77  87.0    20
May     132   NaN    52

In [0]:
# changing index from lower to upper 
upper_index = [indx.upper() for indx in sales_data_frame.index]

# Assign new_idx to sales.index
sales_data_frame.index = upper_index

# Print the sales DataFrame
sales_data_frame.head()

     eggs  salt  spam
JAN    47  12.0    17
FEB   110  50.0    31
MAR   221  89.0    72
APR    77  87.0    20
MAY   132   NaN    52

In [0]:
# Assign name to the indexs 
sales_data_frame.index.name = 'MONTHS'

# Print the sales DataFrame
sales_data_frame.head()

        eggs  salt  spam
MONTHS
JAN       47  12.0    17
FEB      110  50.0    31
MAR      221  89.0    72
APR       77  87.0    20
MAY      132   NaN    52

In [0]:
# give name to column names 
sales_data_frame.columns.name = 'PRODUCTS'

# Print the sales dataframe again
sales_data_frame.head()

PRODUCTS  eggs  salt  spam
MONTHS
JAN         47  12.0    17
FEB        110  50.0    31
MAR        221  89.0    72
APR         77  87.0    20
MAY        132   NaN    52

###multi level hirarchical index
as the name says it is used to have more than one index to collect data more accurately

*   input is the list of columns to use as index
```
SYNTAX:  dataframe.set_index([list of cols])
```

In [0]:
df = sales_data_frame

In [0]:
df.columns.name=None               #removing the columns index name for clarity

In [0]:
df

        eggs  salt  spam
MONTHS
JAN       47  12.0    17
FEB      110  50.0    31
MAR      221  89.0    72
APR       77  87.0    20
MAY      132   NaN    52
JUN      205  60.0    55

In [0]:
df.reset_index(inplace=True)

In [0]:
df

  MONTHS  eggs  salt  spam
0    JAN    47  12.0    17
1    FEB   110  50.0    31
2    MAR   221  89.0    72
3    APR    77  87.0    20
4    MAY   132   NaN    52
5    JUN   205  60.0    55

In [0]:
df.reset_index(inplace=True)    # just to create a extra index

In [0]:
df

   index MONTHS  eggs  salt  spam
0      0    JAN    47  12.0    17
1      1    FEB   110  50.0    31
2      2    MAR   221  89.0    72
3      3    APR    77  87.0    20
4      4    MAY   132   NaN    52
5      5    JUN   205  60.0    55

In [0]:
df.set_index(['MONTHS','index'])           # multi indexed with month and index

              eggs  salt  spam
MONTHS index
JAN    0        47  12.0    17
FEB    1       110  50.0    31
MAR    2       221  89.0    72
APR    3        77  87.0    20
MAY    4       132   NaN    52
JUN    5       205  60.0    55

###Pivoting DataFrames:
 pivot method lets us specify which columns to use as index and which to use as columns 


```
SYNTAX:  .pivot(index= , columns= , values= )
```

In [0]:
users_data_frame = pd.read_csv('/content/gdrive/My Drive/datasets/users.csv', header=0, index_col=0)

In [0]:
users_data_frame

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [0]:
# Pivot the database to focus on visitors
visitors_data_frame = users_data_frame.pivot(index = 'weekday',columns ='city',values = 'visitors')

In [0]:
visitors_data_frame

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

In [0]:
# Pivot the database to focus on signups
signups_data_frame = users_data_frame.pivot(index='weekday', columns='city', values='signups')

In [0]:
signups_data_frame

city     Austin  Dallas
weekday
Mon           3       5
Sun           7      12

In [0]:
# Pivot data base by both signups and visitors
pivoted_data_frame = users_data_frame.pivot(index='weekday', columns='city')

In [0]:
pivoted_data_frame

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

### stacking and unstacking:
 

*   unstacking = it means to remove the multi index , and used as column index

*   stacking = to convert the data frame into a multi level indexed data frame

In [0]:
users_data_frame

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [0]:
#reindexing the data frame to a new data frame with multi index

In [0]:
users_multi_index_data_frame = users_data_frame.set_index(['city','weekday'])

In [0]:
users_multi_index_data_frame.sort_index()

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

In [0]:
#to unstack 
weekday_unstacked = users_multi_index_data_frame.unstack(level='weekday')     # alt.  level=1 can also be used

In [0]:
weekday_unstacked

        visitors      signups
weekday      Mon  Sun     Mon Sun
city
Austin       326  139       3   7
Dallas       456  237       5  12

In [0]:
city_unstacked = users_multi_index_data_frame.unstack(level='city')

In [0]:
city_unstacked

        visitors        signups
city      Austin Dallas  Austin Dallas
weekday
Mon          326    456       3      5
Sun          139    237       7     12

In [0]:
#stack 
city_stacked = city_unstacked.stack('city')

In [0]:
city_stacked

                visitors  signups
weekday city
Mon     Austin       326        3
        Dallas       456        5
Sun     Austin       139        7
        Dallas       237       12

In [0]:
# to swap the indexs
city_stacked = city_stacked.swaplevel(0,1)

In [0]:
city_stacked

                visitors  signups
city   weekday
Austin Mon           326        3
Dallas Mon           456        5
Austin Sun           139        7
Dallas Sun           237       12

In [0]:
city_stacked = city_stacked.sort_index()           # sorting the index of the data frame
city_stacked

                visitors  signups
city   weekday
Austin Mon           326        3
       Sun           139        7
Dallas Mon           456        5
       Sun           237       12

### Melt dataframes:
melt is used to unpivot or to make column to rows and rows to columns

In [0]:
visitors_data_frame

city     Austin  Dallas
weekday
Mon         326     456
Sun         139     237

In [0]:
 visitors_unindexed = visitors_data_frame.reset_index()
 visitors_unindexed

city weekday  Austin  Dallas
0        Mon     326     456
1        Sun     139     237

In [0]:
visitors_melt_data_frame = pd.melt(visitors_unindexed)
visitors_melt_data_frame

      city value
0  weekday   Mon
1  weekday   Sun
2   Austin   326
3   Austin   139
4   Dallas   456
5   Dallas   237

In [0]:
# we do not want the weekday to change 
visitors_melt_data_frame = pd.melt(visitors_unindexed, id_vars='weekday')
visitors_melt_data_frame

  weekday    city  value
0     Mon  Austin    326
1     Sun  Austin    139
2     Mon  Dallas    456
3     Sun  Dallas    237

In [0]:
# to give the column name instead of value
visitors_melt_data_frame = pd.melt(visitors_unindexed, id_vars='weekday', value_name='visitors')
visitors_melt_data_frame.sort_index()

  weekday    city  visitors
0     Mon  Austin       326
1     Sun  Austin       139
2     Mon  Dallas       456
3     Sun  Dallas       237

### pivot table

In [0]:
users_data_frame

  weekday    city  visitors  signups
0     Sun  Austin       139        7
1     Sun  Dallas       237       12
2     Mon  Austin       326        3
3     Mon  Dallas       456        5

In [0]:
city_weekday = users_data_frame.pivot_table(index='city', columns='weekday')
city_weekday

        signups     visitors
weekday     Mon Sun      Mon  Sun
city
Austin        3   7      326  139
Dallas        5  12      456  237

In [0]:
city_weekday = users_data_frame.pivot_table(index='weekday', columns='city')
city_weekday.sort_index()

        signups        visitors
city     Austin Dallas   Austin Dallas
weekday
Mon           3      5      326    456
Sun           7     12      139    237

In [0]:
#example to better understand the pivot table
# to have a data frame to show the total number of visitors and signups
signups_visitors = users_data_frame.pivot_table(index='weekday',columns='city', aggfunc=sum, margins=True)
signups_visitors

        signups            visitors
city     Austin Dallas All   Austin Dallas   All
weekday
Mon           3      5   8      326    456   782
Sun           7     12  19      139    237   376
All          10     17  27      465    693  1158

### Using groupby()

In [0]:
titanic_data_frame = pd.read_csv('/content/gdrive/My Drive/datasets/titanic.csv', header=0)

In [0]:
titanic_data_frame.head(3)

   pclass  survived  ... body                        home.dest
0       1         1  ...  NaN                     St Louis, MO
1       1         1  ...  NaN  Montreal, PQ / Chesterville, ON
2       1         0  ...  NaN  Montreal, PQ / Chesterville, ON

[3 rows x 14 columns]

In [0]:
titanic_data_frame.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1309 entries, 0 to 1308
Data columns (total 14 columns):
pclass       1309 non-null int64
survived     1309 non-null int64
name         1309 non-null object
sex          1309 non-null object
age          1046 non-null float64
sibsp        1309 non-null int64
parch        1309 non-null int64
ticket       1309 non-null object
fare         1308 non-null float64
cabin        295 non-null object
embarked     1307 non-null object
boat         486 non-null object
body         121 non-null float64
home.dest    745 non-null object
dtypes: float64(3), int64(4), object(7)
memory usage: 143.3+ KB

In [0]:
titanic_data_frame.shape

(1309, 14)

In [0]:
titanic_by_class = titanic_data_frame.groupby('pclass')
titanic_by_class.head(3)                                    # in this case we got 3 rows of every pclass

     pclass  survived  ...   body                        home.dest
0         1         1  ...    NaN                     St Louis, MO
1         1         1  ...    NaN  Montreal, PQ / Chesterville, ON
2         1         0  ...    NaN  Montreal, PQ / Chesterville, ON
323       2         0  ...    NaN              Russia New York, NY
324       2         1  ...    NaN              Russia New York, NY
325       2         0  ...    NaN               Bryn Mawr, PA, USA
600       3         0  ...    NaN                              NaN
601       3         0  ...    NaN              East Providence, RI
602       3         0  ...  190.0              East Providence, RI

[9 rows x 14 columns]

In [0]:
#calculating the number of survivers by class 
titanic_survived_by_class = titanic_by_class['survived'].count()
titanic_survived_by_class

pclass
1    323
2    277
3    709
Name: survived, dtype: int64

In [0]:
#for accurate insights
titanic_embarked_by_class = titanic_data_frame.groupby(['embarked','pclass'])
titanic_embarked_by_class.head(3)

     pclass  survived  ...   body                                 home.dest
0         1         1  ...    NaN                              St Louis, MO
1         1         1  ...    NaN           Montreal, PQ / Chesterville, ON
2         1         0  ...    NaN           Montreal, PQ / Chesterville, ON
9         1         0  ...   22.0                       Montevideo, Uruguay
10        1         0  ...  124.0                              New York, NY
11        1         1  ...    NaN                              New York, NY
168       1         1  ...    NaN                                       NaN
206       1         0  ...  230.0                           Fond du Lac, WI
207       1         1  ...    NaN                             Green Bay, WI
208       1         1  ...    NaN                           Fond du Lac, WI
284       1         1  ...    NaN                            Cincinatti, OH
323       2         0  ...    NaN                       Russia New York, NY
324       2         1  ...    NaN                       Russia New York, NY
325       2         0  ...    NaN                        Bryn Mawr, PA, USA
326       2         0  ...    NaN  Buenos Aires, Argentina / New Jersey, NJ
327       2         0  ...    NaN            Cornwall, England Houghton, MI
391       2         0  ...  295.0                 Lucca, Italy / California
469       2         1  ...    NaN                            Harrisburg, PA
470       2         0  ...    NaN                                       NaN
472       2         0  ...    NaN                      Glasgow / Bangor, ME
600       3         0  ...    NaN                                       NaN
601       3         0  ...    NaN                       East Providence, RI
602       3         0  ...  190.0                       East Providence, RI
607       3         1  ...    NaN                            Greensburg, PA
613       3         1  ...    NaN                  Syria Fredericksburg, VA
647       3         1  ...    NaN                                Ottawa, ON
667       3         0  ...    NaN                              New York, NY
682       3         0  ...    NaN                       Ireland Chicago, IL
683       3         0  ...    NaN                       Ireland Chicago, IL

[29 rows x 14 columns]

In [0]:
titanic_survived_by_class_and_embarked = titanic_embarked_by_class['survived'].count()
titanic_survived_by_class_and_embarked

embarked  pclass
C         1         141
          2          28
          3         101
Q         1           3
          2           7
          3         113
S         1         177
          2         242
          3         495
Name: survived, dtype: int64

In [0]:
# calculate the average fare and min age of each class 
fare_by_class = titanic_by_class[['fare', 'age']]
aggerate_fare_age = fare_by_class.agg(['median','min'])

In [0]:
aggerate_fare_age.head()

           fare         age
         median  min median   min
pclass
1       60.0000  0.0   39.0  0.92
2       15.0458  0.0   29.0  0.67
3        8.0500  0.0   24.0  0.17

In [0]:
# to check the fare
aggerate_fare_age.loc[:, ('fare','median')]

pclass
1    60.0000
2    15.0458
3     8.0500
Name: (fare, median), dtype: float64

In [31]:
titanic_data_frame.head()

   pclass embarked  survived  ... boat   body                        home.dest
0       1        S         1  ...    2    NaN                     St Louis, MO
1       1        S         1  ...   11    NaN  Montreal, PQ / Chesterville, ON
2       1        S         0  ...  NaN    NaN  Montreal, PQ / Chesterville, ON
3       1        S         0  ...  NaN  135.0  Montreal, PQ / Chesterville, ON
4       1        S         0  ...  NaN    NaN  Montreal, PQ / Chesterville, ON

[5 rows x 14 columns]

In [0]:
titanic_indexed_class_embarked = titanic_data_frame.set_index(['pclass', 'embarked'])

In [38]:
titanic_indexed_class_embarked.head()

                 survived  ...                        home.dest
pclass embarked            ...
1      S                1  ...                     St Louis, MO
       S                1  ...  Montreal, PQ / Chesterville, ON
       S                0  ...  Montreal, PQ / Chesterville, ON
       S                0  ...  Montreal, PQ / Chesterville, ON
       S                0  ...  Montreal, PQ / Chesterville, ON

[5 rows x 12 columns]

In [0]:
by_class = titanic_indexed_class_embarked.groupby(level='pclass')

In [37]:
by_class.head()

                 survived  ...                                 home.dest
pclass embarked            ...
1      S                1  ...                              St Louis, MO
       S                1  ...           Montreal, PQ / Chesterville, ON
       S                0  ...           Montreal, PQ / Chesterville, ON
       S                0  ...           Montreal, PQ / Chesterville, ON
       S                0  ...           Montreal, PQ / Chesterville, ON
2      C                0  ...                       Russia New York, NY
       C                1  ...                       Russia New York, NY
       S                0  ...                        Bryn Mawr, PA, USA
       S                0  ...  Buenos Aires, Argentina / New Jersey, NJ
       S                0  ...            Cornwall, England Houghton, MI
3      S                0  ...                                       NaN
       S                0  ...                       East Providence, RI
       S                0  ...                       East Providence, RI
       S                1  ...                       East Providence, RI
       S                1  ...                    Norway Los Angeles, CA

[15 rows x 12 columns]

In [0]:
total_fare_collected = by_class.agg({'fare':'sum'})

In [41]:
total_fare_collected

              fare
pclass
1       28265.4043
2        5866.6374
3        9418.4452

### Using groupby() in datetime indexs

In [0]:
feb_sales_2015 = pd.read_csv('/content/gdrive/My Drive/datasets/sales/sales-feb-2015.csv', header=0, index_col='Date', parse_dates=True)

In [0]:
feb_sales_2015.sort_index(inplace=True)

In [57]:
feb_sales_2015.head()

                             Company   Product  Units
Date
2015-02-02 08:33:01            Hooli  Software      3
2015-02-02 20:54:49        Mediacore  Hardware      9
2015-02-03 14:14:18          Initech  Software     13
2015-02-04 15:36:29        Streeplex  Software     13
2015-02-04 21:52:45  Acme Coporation  Hardware     14

In [58]:
feb_sales_2015.tail()

                       Company   Product  Units
Date
2015-02-21 05:01:26  Mediacore  Software      3
2015-02-21 20:41:47      Hooli  Hardware      3
2015-02-25 00:29:00    Initech   Service     10
2015-02-26 08:57:45  Streeplex   Service      4
2015-02-26 08:58:51  Streeplex   Service      1

In [0]:
# aggregate the sum of the units sold everyday
per_day_units_sold = feb_sales_2015.resample('D').sum()

In [67]:
per_day_units_sold.head()

            Units
Date
2015-02-02     12
2015-02-03     13
2015-02-04     27
2015-02-05     29
2015-02-06      0

In [0]:
#  group the data by the day of the week and aggregate the sum of the units
groupby_day = feb_sales_2015.groupby(feb_sales_2015.index.strftime('%a'))

In [79]:
day_units_sold = groupby_day['Units'].sum()
day_units_sold

Mon    48
Sat     7
Thu    60
Tue    13
Wed    48
Name: Units, dtype: int64

### Using  ***.transform()***